rx-ted/N32-RTT/example/Led_blink/.pack/Nationstech/N32G4FR_DFP.1.0.4/Nationstech.N32G4FR_DFP.1.0.4.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.0" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Nationstech</vendor>
    <url>http://www.keil.com/pack/</url>
    <name>N32G4FR_DFP</name>

    <description>Nationstech N32G4FR Series Device Support, Drivers and Examples</description>

    <releases>
        <release version="1.0.4">
            Add WWDG peripheral
        </release>
        <release version="1.0.3">
            Modify some errors of device description.
        </release>
    <release version="1.0.2">
            Delete firmware.
        </release>
        <release version="1.0.1">
            Fix some bug.
        </release>
        <release version="1.0.0">
            Fix some bug.
        </release>
        <release version="0.4.0">
            First version.
        </release>
    </releases>

    <keywords>
        <keyword>Nationstech</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G4FR</keyword>
        <keyword>N32</keyword>
    </keywords>


    <devices>
        <family Dfamily="N32G4FR Series" Dvendor="Nationstech:927">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
            <description>
            </description>
            <subFamily DsubFamily="N32G4FR">
                <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 144KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, 1xQSPI, USB 2.0 FS Device, RTC, 2x 12bit 5Msps ADC, 2x12bit DAC, DVP, up to 18 Channels TSC, Hardware Cryptographic Engine, Fingerprint algorithm.
                </description>
                <processor Dclock="144000000"/>
                <compile header="firmware/CMSIS/device/n32g4fr.h" define="N32G4FR USE_STDPERIPH_DRIVER"/>

<device Dname="N32G4FRKCQ7">
    <description>
&#xA;&#xD;
- Package:QFN32&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    24&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  6&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    10&#xA;&#xD;
- ADC:    1x12bit with 7 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  1&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:2/1&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- TSC:    2&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G4FR.svd"/>
</device>


<device Dname="N32G4FRKEQ7">
    <description>
&#xA;&#xD;
- Package:QFN32&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    24&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  6&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    10&#xA;&#xD;
- ADC:    1x12bit with 7 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  1&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:2/1&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- TSC:    2&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G4FR.svd"/>
</device>


<device Dname="N32G4FRHCQ7">
    <description>
&#xA;&#xD;
- Package:QFN40&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    32&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  7&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    12&#xA;&#xD;
- ADC:    2x12bit with 11 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- TSC:    5&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- DVP:   Y&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G4FR.svd"/>
</device>


<device Dname="N32G4FRHEQ7">
    <description>
&#xA;&#xD;
- Package:QFN40&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    32&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  7&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    12&#xA;&#xD;
- ADC:    2x12bit with 11 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  2&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- TSC:    5&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- DVP:   Y&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G4FR.svd"/>
</device>


<device Dname="N32G4FRREL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    2x12bit with 16 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- TSC:    16&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
- DVP:   Y&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G4FR.svd"/>
</device>


<device Dname="N32G4FRMEL7">
    <description>
&#xA;&#xD;
- Package:LQFP80&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    67&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    2x12bit with 16 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- TSC:    18&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
- DVP:   Y&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G4FR.svd"/>
</device>

            </subFamily>
        </family>
    </devices>
        

    <conditions>
        <condition id="Compiler ARM">            <!-- conditions selecting ARM Compiler -->
            <require Tcompiler="ARMCC"/>
        </condition>

        <condition id="N32G4FR CMSIS Device">            <!-- conditions selecting Devices -->
            <description>Nationstech N32G4FR Series devices</description>
            <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
            <require Dvendor="Nationstech:927" Dname="N32*"/>
        </condition>

