rx-ted/N32-RTT/example/Led_blink/.pack/Nationstech/N32G4FR_DFP.1.0.4/Nationstech.N32G4FR_DFP.1.0.4.pdsc
        <condition id="N32G4FR STDPERIPH">
            <description>Nationstech N32G4FR Standard Peripherals Drivers</description>
            <require condition="N32G4FR CMSIS Device"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>

        <condition id="N32G4FR STDPERIPH RCC">
            <description>Nationstech N32G4FR Standard Peripherals Drivers with RCC</description>
            <require condition="N32G4FR STDPERIPH"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
        </condition>

        <condition id="N32G4FR Algorithm Common" >
            <description>Nationstech N32G4FR Series Algorithm Libraries Common Functions.</description>
            <require condition="N32G4FR CMSIS Device"/>
            <require Cclass ="Device" Cgroup="Algorithm Libs" Csub="Common"/>
        </condition>

    </conditions>

    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G4FR CMSIS Device">
            <description>Startup File for Nationstech N32G4FR Series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="firmware/CMSIS/device/"/>
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g4fr.s" attr="config" condition="N32G4FR CMSIS Device" version="1.0.0"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="System_N32G4FR" Cversion="1.0.0" condition="N32G4FR CMSIS Device">
            <description>System Clock Config File for Nationstech N32G4FR</description>
            <files>
                <!--  include folder -->
                <file category="include" name="firmware/CMSIS/device/"/>
                <file category="source" name="firmware/CMSIS/device/system_n32g4fr.c" attr="config" version="1.0.0"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="N32G4FR STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g4fr_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/misc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Window watchdog (WWDG) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_wwdg.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_wwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_usart.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_usart.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIMER" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Timers (TIMER) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_tim.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_tim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Serial peripheral interface (SPI) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_spi.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_spi.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Secure digital (SDIO) interface driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_sdio.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_sdio.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_adc.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_adc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKP" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Backup registers (BKPR) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_bkp.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_bkp.c"/>
            </files>
        </component>

