rx-ted/N32-RTT/example/Led_blink/.pack/Nationstech/N32G4FR_DFP.1.0.4/Nationstech.N32G4FR_DFP.1.0.4.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Controller area network (CAN) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_can.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_can.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>CRC calculation unit (CRC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_crc.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_crc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Digital-to-analog converter (DAC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dac.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dac.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="MCUDBG" Cversion="1.0.0" condition="N32G4FR STDPERIPH">
            <description>MCU debug component (MCUDBG) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dbg.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dbg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>DMA controller (DMA) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dma.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dma.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_exti.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_exti.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FLASH" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Embedded Flash memory driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_flash.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>General-purpose I/O (GPIO) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_gpio.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_gpio.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_i2c.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG" Cversion="1.0.0" condition="N32G4FR STDPERIPH">
            <description>Independent watchdog (IWDG) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_iwdg.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Power controller (PWR) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_pwr.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_pwr.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC" Cversion="1.0.0" condition="N32G4FR STDPERIPH">
            <description>Reset and clock control (RCC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_rcc.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_rcc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.0" condition="N32G4FR STDPERIPH">
            <description>Real-time clock (RTC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_rtc.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_rtc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DVP" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Digital video port (DVP) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DVP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dvp.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dvp.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="QSPI" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>Queued SPI (QSPI) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_QSPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_qspi.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_qspi.c"/>
            </files>
        </component>

