rx-ted/N32-RTT/example/Led_blink/.pack/Nationstech/N32G4FR_DFP.1.0.4/Nationstech.N32G4FR_DFP.1.0.4.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USBDEV" Cversion="1.0.0" condition="N32G4FR STDPERIPH RCC">
            <description>USB device (USBDEV) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USBDEV
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g4fr_usbfs_driver/inc" />
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_core.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_def.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_init.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_int.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_lib.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_mem.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_regs.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_sil.h"/>
                <file category="header" name="firmware/n32g4fr_usbfs_driver/inc/usb_type.h"/>
                <file category="source" name="firmware/n32g4fr_usbfs_driver/src/usb_core.c"/>
                <file category="source" name="firmware/n32g4fr_usbfs_driver/src/usb_init.c"/>
                <file category="source" name="firmware/n32g4fr_usbfs_driver/src/usb_int.c"/>
                <file category="source" name="firmware/n32g4fr_usbfs_driver/src/usb_mem.c"/>
                <file category="source" name="firmware/n32g4fr_usbfs_driver/src/usb_regs.c"/>
                <file category="source" name="firmware/n32g4fr_usbfs_driver/src/usb_sil.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="Common" Cversion="1.0.0" condition="N32G4FR CMSIS Device">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g4fr_algo_lib/inc" />
                <file category="header" name="firmware/n32g4fr_algo_lib/inc/n32g4fr_algo_common.h"/>
                <file category="source" name="firmware/n32g4fr_algo_lib/lib/n32g4fr_algo_common.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="AES" Cversion="1.0.0" condition="N32G4FR Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_algo_lib/inc/n32g4fr_aes.h"/>
                <file category="source" name="firmware/n32g4fr_algo_lib/lib/n32g4fr_aes.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="DES" Cversion="1.0.0" condition="N32G4FR Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_algo_lib/inc/n32g4fr_des.h"/>
                <file category="source" name="firmware/n32g4fr_algo_lib/lib/n32g4fr_des.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="RNG" Cversion="1.0.0" condition="N32G4FR Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_RNG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_algo_lib/inc/n32g4fr_rng.h"/>
                <file category="source" name="firmware/n32g4fr_algo_lib/lib/n32g4fr_rng.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="HASH" Cversion="1.0.0" condition="N32G4FR Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_algo_lib/inc/n32g4fr_hash.h"/>
                <file category="source" name="firmware/n32g4fr_algo_lib/lib/n32g4fr_hash.lib"/>
            </files>
        </component>
    </components>
</package>
